namespace AmiableNext.SDK
{
    public enum CommonEventType
    {
        /// <summary>
        /// 消息类型_未定义
        /// </summary>
        Unknow = -1,

        /// <summary>
        /// 消息类型_好友
        /// </summary>
        MessageFriend = 1,
        
        
        /// <summary>
        /// 消息类型_群
        /// </summary>
        MessageGroup = 2,
        消息类型_讨论组 = 3,
        消息类型_群临时会话 = 4,
        消息类型_讨论组临时会话 = 5,
        消息类型_在线临时会话 = 6,
        事件处理_忽略 = 0,
        事件处理_同意 = 0,
        事件处理_拒绝 = 20,
        消息类型_被单向添加好友 = 1000,
        消息类型_被请求添加好友 = 1001,
        /// <summary>
        /// 
        /// </summary>
        消息类型_好友状态改变 = 1002,
        消息类型_被删除好友 = 1003,
        消息类型_好友签名变更 = 1004,
        消息类型_说说被评论 = 1005,
        消息类型_好友正在输入 = 1006,
        消息类型_好友今天首次发起会话 = 1007,
        消息类型_被好友抖动 = 1008,
        消息类型_好友文件接收 = 1009,
        消息类型_好友视频接收 = 1010,
        消息类型_被同意加为好友 = 1011,
        消息类型_被拒绝加为好友 = 1012,
        消息类型_某人申请加入群 = 2001,
        消息类型_某人被邀请加入群 = 2002,
        消息类型_某人已被邀请入群 = 20021,
        消息类型_我被邀请加入群 = 2003,
        消息类型_某人被批准加入了群 = 2005,
        消息类型_某人退出群 = 2006,
        消息类型_某人被管理移除群 = 2007,
        消息类型_某群被解散 = 2008,
        消息类型_某人成为管理 = 2009,
        消息类型_某人被取消管理 = 2010,
        消息类型_群名片变动 = 2011,
        消息类型_群名变动 = 2012,
        消息类型_群公告变动 = 2013,
        消息类型_对象被禁言 = 2014,
        消息类型_对象被解除禁言 = 2015,
        消息类型_群管开启全群禁言 = 2016,
        消息类型_群管关闭全群禁言 = 2017,
        消息类型_群管开启匿名聊天 = 2018,
        消息类型_群管关闭匿名聊天 = 2019,
        消息类型_群撤回消息 = 2020,
        消息类型_好友撤回消息 = 13002,
        消息类型_群文件接收 = 2021,
        消息类型_群视频接收 = 2022,
        消息类型_好友语音接收 = 3001,
        消息类型_群语音接收 = 3002,
        消息类型_群消息被设置为精华 = 3003,
        消息类型_群消息被取消精华 = 3004,
        消息类型_框架加载完成 = 10000,
        消息类型_框架即将重启 = 10001,
        消息类型_添加了一个新的帐号 = 11000,
        消息类型_QQ登录完成 = 11001,
        消息类型_QQ被手动离线 = 11002,
        消息类型_QQ被强制离线 = 11003,
        消息类型_QQ长时间无响应或掉线 = 11004,
        消息类型_本插件载入 = 12000,
        消息类型_插件被启用 = 12001,
        消息类型_插件被禁用 = 12002,
        消息类型_插件被点击 = 12003,
        消息类型_收到财付通转账 = 80001,
        消息类型_收到群聊红包 = 80002,
        消息类型_收到私聊红包 = 80003,
        消息类型_机器人发出消息 = 80004,
        消息类型_其他设备上线 = 13000,
        消息类型_其他设备下线 = 13001,
        消息处理_忽略 = 0,
        消息处理_继续 = 1,
        消息处理_拦截 = 2,
        状态_在线 = 10,
        状态_离开 = 30,
        状态_忙碌 = 50,
        状态_Q我吧 = 60,
        状态_勿扰 = 70,
        状态_隐身 = 40
    }
}